Repository: AWeleczka/LocalizableUIElements
Catalog: LocalizableUIElements/LocalizableUIElementsDemo/*.lproj/Localizable.strings
Languages: de

# intro.welcome
source: Welcome to this little demo-application for a bit more convenient localization. Everyhing in this app is localized using the LocalizableUIElements-Library. In fact, everything on this page is localized using in-code-localization and everything on the UIElements-Tab is localized using storyboard-localization. Give it a try. The picker below allows you to switch the language used to display the content, by default it will be the user's prefered language.
de: Herzlich willkommen zu dieser kleinen Demo für einfachere Lokalisierung. Alles in dieser App ist mit der LocalizableUIElements-Bibliothek lokalisiert. Um genau zu sein, alles auf dieser Seite ist in-code-lokalisiert udn alles auf der UIElemente-Seite ist storyboard-lokalisiert. Über das Picker-Element unten kannst Du einfach die Sprache der App wechseln, standard ist immer die bevorzugte Sprache des Nutzers.

# TabBar.Item.Features
source: UIElements
de: UIElemente

# TabBar.Item.Contact
source: Contact
de: Kontakt

# Picker.de
source: German
de: Deutsch

# Picker.en
source: English
de: Englisch

# Picker.fr
source: French
de: Französisch

# feature.UILabel
source: Storyboard-Localization for
de: UILabel

# feature.UITextView
source: pretty much anything. Single or Multi-Line UILabel and UITextViews
de: UITextView

# feature.UITextField
source: same for UITextFields
de: UITextField

# feature.UITextField.placeholder
source: or just their placeholders
de: UITextField.placeholder

# feature.UIButton
source: of course UIButtons
de: UIButton

# tests.localize.string
source: english
de: german

# tests.localize.stringformat
source: %@ : english
de: %@ : german

# tests.localize.url
source: https://local.host/en
de: https://local.host/de
